Merge branch 'devel' into feat/waf-integration
